{
    "greeting": "Hello, my name is Alan Borges dos Reis",
    "about": "About me",
    "projects": "Projects",
    "skills": "Skills",
    "certifications": "Certifications",
    "contact":"Contact",
    "about2": "Hello, I’m Alan, a DevOps Engineer focused on automation and cloud infrastructure (AWS and Azure). I am studying Software Engineering at Unicesumar and currently participating in a Microsoft Azure bootcamp, while also being a student at AWS Cloud School, where I am preparing for the AWS Cloud Practitioner and Microsoft Azure certifications. Currently, I am an intern at HZ Sistemas, where I am developing, along with the team, a management system for optical stores. This system is confidential but will be used to sell subscriptions in a SaaS (Software as a Service) model. My responsibilities include configuring and managing Docker environments for development and production, implementing CI/CD pipelines using GitHub Actions, and utilizing Infrastructure as Code (IaC) with Terraform and Ansible for server provisioning and management. I also monitor performance with Prometheus and Grafana, and manage PostgreSQL databases. My experience includes developing automated pipelines, integrating monitoring tools, and applying IaC using technologies like Docker, Kubernetes, and Terraform, as well as CI/CD tools like Jenkins and GitHub Actions. I began my journey in technology in 2023, developing games in Unity. Today, I am focused on DevOps and SRE, emphasizing infrastructure automation and container orchestration. I am proficient in Python and Bash, and I apply the best practices of Cloud Computing to create scalable and secure solutions.",
    "Hability":"Skills",
    "Aws":"AWS (Amazon Web Services) – Experience in configuration, management of EC2, S3, and RDS instances, as well as integration with other cloud services.",
    "Docker": "Docker: Containers, Docker Compose – Creation and orchestration of containers, optimization of development and production environments.",
    "Kubernetes":"Kubernetes: Creation and management of clusters, implementation of horizontal and vertical scalability strategies for mission-critical applications, using resources such as Deployments, Services, Ingresses and NetworkPolicies.",
    "Ci/Cd": "CI/CD: Implementation of robust CI/CD pipelines with Jenkins, GitLab CI and GitHub Actions, covering everything from construction and testing to deployment in various environments. Experience in unit, integration and end-to-end testing, using tools such as Jest and Selenium.",
    "Iac":"IaC: Infrastructure provisioning and management with Terraform and Ansible, ensuring the reproducibility and scalability of environments. Creation of custom modules to automate repetitive tasks.",
    "Prometheus":"Prometheus, Grafana – Configuration and customization of monitoring systems, dashboards, and alerts to ensure application availability and performance.",
    "Redes":"Networks: Knowledge of TCP/IP networks, configuration of routing and firewalls, VPNs, and network security practices.",
    "Git":"Git Versioning Control: Git GitHub GitLab – Advanced use of code versioning, branch management, pull requests and integration with CI/CD.",
    "Github":"Github code versioning, Using GitHub tools, such as GitHub Actions to automate workflows",
    "Gitlab":"GitLab Configuring runners to run pipelines on different platforms",
    "Python":"Python for scripting and automation",
    "Javascript":"JavaScript (fullstack development)",
    "certification":"Certification",
    "certification-aws":"Certifications AWS Cloud Practitioner Certification (in progress)",
    "curriculum":"Download my resume",
    "deploy-automation":"deploy-automation"
}
