{
    "greeting": "Olá, meu nome é Alan Borges dos Reis",
    "about": "Sobre mim",
    "projects": "Projetos",
    "skills": "Habilidades",
    "certifications": "Certificações",
    "contact":"Contato",
    "about2": "Olá, sou Alan, DevOps Engineer com foco em automação e infraestrutura em nuvem (AWS e Azure). Estudo Engenharia de Software na Unicesumar e estou participando de um bootcamp da Microsoft Azure, além de ser aluno da Escola da Nuvem da AWS, onde me preparo para as certificações AWS Cloud Practitioner e Microsoft Azure.Atualmente, sou estagiário na HZ Sistemas, onde estou desenvolvendo, em conjunto com a equipe, um sistema de gestão para óticas. Este sistema é confidencial, mas será utilizado para venda de assinaturas no modelo SaaS (Software as a Service). Minhas responsabilidades incluem a configuração e gerenciamento de ambientes Docker para desenvolvimento e produção, implementação de pipelines CI/CD com GitHub Actions e utilização de infraestrutura como código (IaC) com Terraform e Ansible para provisionamento e gerenciamento de servidores. Também faço o monitoramento de performance com Prometheus e Grafana e a gestão de banco de dados PostgreSQL. Minha experiência abrange o desenvolvimento de pipelines automatizados, integração de ferramentas de monitoramento e aplicação de IaC, utilizando tecnologias como Docker, Kubernetes e Terraform, além de ferramentas de CI/CD como Jenkins e GitHub Actions. Iniciei minha trajetória na área de tecnologia em 2023, com o desenvolvimento de jogos em Unity. Hoje, estou focado em DevOps e SRE, com ênfase em automação de infraestrutura e orquestração de containers. Sou proficiente em Python e Bash e aplico as melhores práticas de Cloud Computing para criar soluções escaláveis e seguras.",
    "Hability":"Habilidade",
    "Aws":"AWS (Amazon Web Services) – Experiência em configuração, gerenciamento de instâncias EC2, S3, e RDS, além de integração com outros serviços de nuvem.",
    "Docker":"Docker: Contêineres, Docker Compose – Criação e orquestração de contêineres, otimização de ambientes de desenvolvimento e produção.",
    "Kubernetes":"Kubernetes: Criação e gerenciamento de clusters, implementação de estratégias de escalabilidade horizontal e vertical para aplicações mission-critical, utilizando recursos como Deployments, Services, Ingresses e NetworkPolicies.",
    "Ci/Cd":"CI/CD: Implementação de pipelines CI/CD robustos com Jenkins, GitLab CI e GitHub Actions, abrangendo desde a construção e testes até o deploy em diversos ambientes. Experiência em testes unitários, de integração e end-to-end, utilizando ferramentas como Jest e Selenium.",
    "Iac":"IaC: Provisionamento e gerenciamento de infraestrutura com Terraform e Ansible, garantindo a reprodutibilidade e escalabilidade dos ambientes. Criação de módulos personalizados para automatizar tarefas repetitivas.",
    "Prometheus":"Prometheus, Grafana – Configuração e customização de sistemas de monitoramento, dashboards, e alertas para garantir a disponibilidade e desempenho das aplicações.",
    "Redes":"Redes: Conhecimento em redes TCP/IP, configuração de roteamento e firewalls, VPNs, e práticas de segurança em rede.",
    "Git":"Git Controle de Versionamento: Git GitHub GitLab– Uso avançado de versionamento de código, gerenciamento de branches, pull requests e integração com CI/CD.",
    "Github":"Github versionamento de código, Utilização de ferramentas do GitHub, como GitHub Actions para automatizar workflows",
    "Gitlab":"GitLab Configuração de runners para executar pipelines em diferentes plataformas",
    "Python":"Python para a criação de scripts e automação",
    "Javascript":"Desenvolvimento FullStack",
    "Certification":"Certificação",
    "certification-aws":"Certificação AWS Cloud Practitioner (em andamento)",
    "curriculum":"Baixe meu currículo",
    "deploy-automation":"deploy-automatico"
}
