{
    "greeting": "Olá, meu nome é Alan Borges dos Reis",
    "about": "Sobre mim",
    "projects": "Projetos",
    "skills": "Habilidades",
    "certifications": "Certificações",
    "contact":"contato",
    "about2": "Olá, sou Alan, estudante de Engenharia de Software na Unicesumar com forte paixão por DevOps. Iniciei na área de tecnologia em 2023 com o desenvolvimento de jogos em Unity, onde adquiri conhecimentos em C#. Atualmente, estou focado em dominar as melhores práticas de DevOps, com ênfase em automação de infraestrutura utilizando Terraform e orquestração de containers com Kubernetes. Possuo experiência prática em CI/CD com Jenkins e sou proficiente em linguagens como Python e Bash. Busco constantemente aprimorar minhas habilidades através de projetos pessoais.",
    "Hability":"Habilidade",
    "Aws":"AWS (Amazon Web Services) – Experiência em configuração, gerenciamento de instâncias EC2, S3, e RDS, além de integração com outros serviços de nuvem.",
    "Docker":"Docker: Contêineres, Docker Compose – Criação e orquestração de contêineres, otimização de ambientes de desenvolvimento e produção.",
    "Kubernetes":"Kubernetes: Criação e gerenciamento de clusters, implementação de estratégias de escalabilidade horizontal e vertical para aplicações mission-critical, utilizando recursos como Deployments, Services, Ingresses e NetworkPolicies.",
    "Ci/Cd":"CI/CD: Implementação de pipelines CI/CD robustos com Jenkins, GitLab CI e GitHub Actions, abrangendo desde a construção e testes até o deploy em diversos ambientes. Experiência em testes unitários, de integração e end-to-end, utilizando ferramentas como Jest e Selenium.",
    "Iac":"IaC: Provisionamento e gerenciamento de infraestrutura com Terraform e Ansible, garantindo a reprodutibilidade e escalabilidade dos ambientes. Criação de módulos personalizados para automatizar tarefas repetitivas.",
    "Prometheus":"Prometheus, Grafana – Configuração e customização de sistemas de monitoramento, dashboards, e alertas para garantir a disponibilidade e desempenho das aplicações.",
    "Redes":"Redes: Conhecimento em redes TCP/IP, configuração de roteamento e firewalls, VPNs, e práticas de segurança em rede.",
    "Git":"Git Controle de Versionamento: Git GitHub GitLab– Uso avançado de versionamento de código, gerenciamento de branches, pull requests e integração com CI/CD.",
    "Github":"Github versionamento de código, Utilização de ferramentas do GitHub, como GitHub Actions para automatizar workflows",
    "Gitlab":"GitLab Configuração de runners para executar pipelines em diferentes plataformas",
    "Python":"Python para a criação de scripts e automação",
    "Javascript":"Desenvolvimento FullStack"
}